---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.JoinedRoofMissesTarget
source: html/8f54628a-2f57-361b-3428-91fd6ddf7f8d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.JoinedRoofMissesTarget Property

Part of the roof to be joined misses the target face.

## Syntax (C#)
```csharp
public static FailureDefinitionId JoinedRoofMissesTarget { get; }
```